In [1]:
import pandas as pd
data={'Name':["John","Anna","Peter","Linda"],
     'Location':["New York","Paris","Berlin","London"],
     'Age':[24,13,53,33]
     }
data_pandas=pd.DataFrame(data)
display(data_pandas)

    Name  Location  Age
0   John  New York   24
1   Anna     Paris   13
2  Peter    Berlin   53
3  Linda    London   33

In [2]:
display(data_pandas[data_pandas.Age>30])

    Name Location  Age
2  Peter   Berlin   53
3  Linda   London   33

In [3]:
from sklearn.datasets import load_iris
iris_dataset=load_iris()

In [4]:
print("Keys of iris_dataset:\n",iris_dataset.keys())

Keys of iris_dataset:
 dict_keys(['data', 'target', 'frame', 'target_names', 'DESCR', 'feature_names', 'filename'])

In [5]:
print(iris_dataset['DESCR'][:193]+"\n...")

.. _iris_dataset:

Iris plants dataset
--------------------

**Data Set Characteristics:**

    :Number of Instances: 150 (50 in each of three classes)
    :Number of Attributes: 4 numeric, pre
...

In [6]:
print("Target names:",iris_dataset['target_names'])

Target names: ['setosa' 'versicolor' 'virginica']